[{"text": " Chuck Norris wrote a complete Perl 6 implementation in a day, but then destroyed all evidence with his bare hands, so no-one will know his secrets. ", "num": 1}, {"text": " Chuck Norris refactors 10 million lines of Perl code before lunch. ", "num": 2}, {"text": " Chuck Norris is his own boss. If you hire him, he'll tell your boss what to do. ", "num": 3}, {"text": " Chuck Norris wrote the entire English Wikipedia in 24 hours. Twice.The first time longhand in blood. The second time he typed it in from memory. ", "num": 4}, {"text": " Chuck Norris does not code; when he sits at a computer, it just does whatever he wants. ", "num": 5}, {"text": " Chuck Norris commits with a roundhouse kick into the SVN server's head. ", "num": 6}, {"text": " Chuck Norris doesn't make mistakes. He corrects God. ", "num": 7}, {"text": " Chuck Norris is the ghost author of the entire Debian GNU/Linux distribution. And he wrote it in 24 hours, while taking snack breaks. ", "num": 8}, {"text": " Chuck Norris doesn't commit changes, the changes commit for him. ", "num": 9}, {"text": " Bugs are too afraid to reproduce on Chuck Norris' computer. As a result, when he uses Microsoft Windows, it behaves just like a Linux system. ", "num": 10}, {"text": " Chuck Norris is a real programmer. He writes programs by implementing the most optimised machines for them using real atoms. ", "num": 11}, {"text": " Deletionists delete Wikipedia articles that they consider lame. Chuck Norris deletes Deletionists whom he considers lame. ", "num": 12}, {"text": " There are no deletionists. Only Wikipedia articles Chuck Norris allows to live. (By: ", "num": 13}, {"text": " Wikipedia deletionists don't delete lame Wikipedia articles. Chuck Norris deletes lame Wikipedia articles. ", "num": 14}, {"text": " No one knows all of Perl - not even Larry Wall. Except Chuck Norris, who knows all of Perl 5, Perl 6 and can answer questions about the design of Perl 7. ", "num": 15}, {"text": " Chuck Norris reads all messages posted to LKML (= the Linux Kernel Mailing List), understands them all, and he kills all gnomes he sees in sight. ", "num": 16}, {"text": " When Chuck Norris uses Gentoo, \"emerge kde\" finishes in under a minute. A computer cannot afford to keep Chuck waiting for too long. ", "num": 17}, {"text": " Chuck Norris is the greatest man in history. He killed all the great men who could ever pose a competition. ", "num": 18}, {"text": " \"My only boss is God. And Chuck Norris who is his boss.\" ", "num": 19}, {"text": " Chuck Norris can make the statement \"This statement is false.\" a true one. ", "num": 20}, {"text": " Chuck Norris can end world hunger, but he thinks that hungry people make humanity a more challenging adversary. If everyone had enough to eat, it would be too easy for him. ", "num": 21}, {"text": " Chuck Norris can read Perl code that was RSA encrypted. ", "num": 22}, {"text": " Chuck Norris once wrote a 10 million lines C++ program in Microsoft Notepad without having to use the backspace key. And it compiled without errors or warnings, and was 100% bug-free. ", "num": 23}, {"text": " If the mountain will not come to Muhammad, then Muhammad will go to the mountain. If the mountain will not come to Chuck Norris, then the mountain will suffer Norriss wrath for not complying with his whims. ", "num": 24}, {"text": " Chuck Norris has 0 messages in his E-mail inbox. Including already read ones. ", "num": 25}, {"text": " Chuck Norris was never a newbie! He will kill anyone who implies otherwise. In a very not newbie-like manner. ", "num": 26}, {"text": " Only perl and Chuck Norris can parse Perl. ", "num": 27}, {"text": " All Chuck Norris has to do is *look* at Perl code and it interprets itself out of fear and respect. ", "num": 28}, {"text": " Chuck Norris taught God how to create the universe. ", "num": 29}, {"text": " Chuck Norris is the reason why the Knights who until Recently Said Ni, are no longer saying Ni. ", "num": 30}, {"text": " Chuck Norris is not afraid of superstitions. Superstitions are afraid of Chuck Norris. ", "num": 31}, {"text": " Chuck Norris does expect the Spanish Inquisition. ", "num": 32}, {"text": " The Spanish Inquisition does not expect Chuck Norris. ", "num": 33}, {"text": " A wood chuck cant chuck wood. Chuck Norris can chuck wood chucks. ", "num": 34}, {"text": " If Chuck Norris asks you What's up? and you answer it literally, then he will club you senseless with all the volumes of the Oxford English Dictionary, and all the servers hosting en.wiktionary.org, to teach you a lesson. ", "num": 35}, {"text": " XSLT is the worst thing since non-sliced bread. ", "num": 36}, {"text": " Mothers used to tell their children stories about XSLT to scare them. ", "num": 37}, {"text": " XSLT is the number one cause of programmers' suicides since Visual Basic 1.0. ", "num": 38}, {"text": " The X in XSLT stands for eXtermination. ", "num": 39}, {"text": " The only things worse than XSLT are Excel and Sugar-Less Tea (XSLT). ", "num": 40}, {"text": " XSLT is what Chuck Norris has nightmares of. ", "num": 41}, {"text": " Confucius says: \"XSLT made me realise humanity was hopeless.\". ", "num": 42}, {"text": " Even APL won't make friends with XSLT. ", "num": 43}, {"text": " God considered using XSLT as the tenth plague of Egypt, but then thought it was too evil. ", "num": 44}, {"text": " In Soviet Russia, XSLT codes you. Badly! ", "num": 45}, {"text": " Satan condemned Hitler for a million years of writing XSLT. ", "num": 46}, {"text": " The KGB used to torture their victims by having them look at scrolling XSLT code. ", "num": 47}, {"text": " \"My name is Inigo Montoya. You forced my father to write XSLT. Prepare to die! And be thankful I don't force you to write XSLT.\" ", "num": 48}, {"text": " Stray XSLT code causes more deaths than road accidents. ", "num": 49}, {"text": " http://en.wikipedia.org/wiki/Evil redirects to XSLT. ", "num": 50}, {"text": "Larry Wall can understand the Perl code he wrote last year.", "num": 51}, {"text": "Larry Wall gets the colon.", "num": 52}, {"text": "There are at least 137 Larry Walls in the U.S. but only one that matters.", "num": 53}, {"text": "Larry Wall applies a patch manually quicker than GNU patch.", "num": 54}, {"text": "Larry Wall dreams in Perl.", "num": 55}, {"text": "Larry Wall can program in his sleep.", "num": 56}, {"text": "Larry Wall is lazy, impatient and full of hubris.", "num": 57}, {"text": "Larry Wall has more dollars in the bank than in his Perl code.", "num": 58}, {"text": " Larry Wall does know all of Perl. However, he pretends to be wrong or misinformed, so people will think he's not as awesome as he really is. ", "num": 59}, {"text": " Larry Wall's pure-Perl code is faster than Assembly. ", "num": 60}, {"text": " Larry Wall has been changing the world. By modifying its very source code. ", "num": 61}, {"text": " We have nothing to fear but fear itself. Fear has nothing to fear but XSLT. ", "num": 62}, {"text": " The devil created a 10th circle of hell for the inventors of XSLT, because the first nine circles were too mild for them. ", "num": 63}, {"text": " Larry Wall can make shit up, and the computer will understand what he means. ", "num": 64}, {"text": " In Soviet Russia, superstition believes in you. ", "num": 65}, {"text": " Chuck Norris helps the gods that help themselves. ", "num": 66}, {"text": " If Chuck Norris had been born before World War II, there would have been only one world war. However, there would have been three largescale Chuck Norris masacares of Nazis and Communists. ", "num": 67}, {"text": " If the mountain does not come to Muhammad, then Chuck Norris will bring the mountain over. ", "num": 68}, {"text": " An apple a day will keep Chuck Norris away. But not for long. ", "num": 69}, {"text": " Reality to be conquered must be obeyed. Youd better obey Chuck Norris or hell conquer you. ", "num": 70}, {"text": " Chuck Norris had a problem so he decided to use regular expressions. Now, all the Worlds problems are solved. ", "num": 71}, {"text": " A is A and A is not not-A  unless Chuck Norris says so. ", "num": 72}, {"text": " Chuck Norris can make East and West meet. ", "num": 73}, {"text": " When Chuck Norris orders Pizza, it arrives before he presses the OK button. ", "num": 74}, {"text": " Chuck Norris does not need to heat up food. The food is already warm right after he took it out of the fridge. ", "num": 75}, {"text": " Chucks idea of a short walk is to the Andromeda Galaxy and back. ", "num": 76}, {"text": " Chuck Norris hasn't taken these facts down yet, so they must be true. ", "num": 77}, {"text": " For every A, Chuck Norris is both A and not-A. Chuck Norris is fucking everything. ", "num": 78}, {"text": " Tomorrow never dies, unless Chuck Norris volunteers to take it out of its misery ", "num": 79}, {"text": " God created the world in 6 days and rested on the 7th. Chuck Norris created the world in one day, and has been incrementally destroying it every day since, without rest. ", "num": 80}, {"text": " Chuck Norris is always right. Even if he says that A is not-A, he would be right, because Logic is subject to his whims. ", "num": 81}, {"text": " Chuck Norris does not own a dishwasher. His dishes know better than to become dirty. ", "num": 82}, {"text": " The NSA dont publish. They perish. ", "num": 83}, {"text": " The NSA employs the largest number of mathematicians with Ph.Ds. And the most stupid and incompetent ones. ", "num": 84}, {"text": " The NSA has a patent for an efficient process for collecting a lot of information and doing nothing with it. ", "num": 85}, {"text": " The Bajoran scholars have positively identified Benjamin Sisko as The Emissary. They also positively identified the NSA headquarters as The Dungeon. ", "num": 86}, {"text": " One of Buffy the Vampire Slayers episodes took place in the NSA headquarters, but had to be destroyed, because all of the test audience had uncontrollable panic attacks. ", "num": 87}, {"text": " The NSA knows what you did last summer. But no one, in the NSA or outside it, knows why they should. ", "num": 88}, {"text": " With the NSAs budget you would expect evil to be extinct by now. (By Kika). ", "num": 89}, {"text": " Think of the most incompetent organisation possible. The NSA would be more even more incompetent than that. ", "num": 90}, {"text": " The NSA headquarters are the unhappiest place on Earth. ", "num": 91}, {"text": " Yogurt: Never overestimate the power of the NSA. ", "num": 92}, {"text": " First the NSA ignores silly Internet memes, then they laugh at them, then they are unable to fight them, and then they lose. ", "num": 93}, {"text": " The NSA is an intelligence agency which thinks it can use Artificial Ultra-Stupidity (AUS) to wade through tons of irrelevant information and reach genuine understanding. ", "num": 94}, {"text": " Buffy will always find a wooden stake to slay vampires, even if it means she will have travelled 100 years back in time, to plant a tree nearby. ", "num": 95}, {"text": " Buffy Summers does not really need stakes to slay vampires, because her kisses are deadly for them. And that includes those that she blows in the air. ", "num": 96}, {"text": " The Chuck Norris of the Buffyverse, has been secretly training under Buffys supervision, and so far  lost every battle with her. ", "num": 97}, {"text": " Buffy is so hot, that you would totally love to fight her. And lose. ", "num": 98}, {"text": " Buffy Summers is not afraid of demons. Demons are afraid of her. and for a very good reason. ", "num": 99}, {"text": " Clarissa Darling can start from I think therefore I am and prove that the grass is green, that there are about 365 days in a year, and that Isaac Newton formulated the Law of Gravitation back in 1687. ", "num": 100}, {"text": " Gdels Incompleteness Theorem is about to be replaced by the [Clarissa] Darling Like, Totally! Completeness Theorem. ", "num": 101}, {"text": " Clarissa Darling will win over Chuck Norris in a battle of wits. ", "num": 102}]
